# UC - 투표전 본인인증 요청


#### 1. Related Requirements: 
REQ-12 (투표자는 공정한 투표 과정을 위해서 투표 전 화상캠과 신분증을 이용한 본인확인 절차를 거친다.)


#### 2. Actor's Goal: 
본인인증을 통해 투표할 수 있는 권한을 갖는다.

#### 3. Initiating actor: 
투표자

#### 4. Flow of Events for Main Success Scenario:

-> 1. 홈페이지에 로그인한 투표자가 특정 선거의 투표버튼을 누른다.
  
<- 2. 본인인증과, 해쉬 함수 처리 과정을 공지해줌으로써 비밀 투표와 공정한 선거임을 명시
  
<- 3a. 투표자와 선거 진행요원을 연결하여 진행요원에의해 투표자가 화상으로 본인인증에 성공한다.(신분증 비교)
  
#### 5. Flow of Events for Extensions:

<- 3b. 본인인증을 실패하였고 다시 시도해달라고 팝업창을 통해 알리고 선거 목록을 보여주는 사이트로 돌아간다.



